/****************************************************************************
  * Файл:           main_simple_VU_meter.cpp
  * Автор:          Никита О.
  * Дата:           17.04.2017
  * Организация:    PhSound
  * Наш сайт:       PhSound.ru
  * e-mail:         PhSound@mail.ru
****************************************************************************/

#include "function.h"

/***************************************************************************/
/* Инициализация                                                           */
/***************************************************************************/
void setup()
{
  Hardware_Init(); // настройка контроллера
  Leds_Off();      // затушить все светодиоды
}

/***************************************************************************/
/* Выполнение задач                                                        */
/***************************************************************************/
void loop()
{
  uint8_t channel_No;
  for(;;)
  { // Вычисление текущего уровня для одного из каналов
    if(channel_No = adc_read_value()) calculate_value(channel_No);
    Leds_Handler(); // подготовка и отправка данных на светодиоды
  }
}
/***************************************************************************/
/* Периодические прерывания по таймеру                                     */
/***************************************************************************/
ISR(TIMER2_COMPA_vect) // прерывание раз в TIME_UPDATE_LEDS мс
{
  Leds_Ready();
}

